zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4100sp256kb_64_tqfp.h
    /* P6.5 */
    P6_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_5_CSD_SENSE                  =  4,       /* csd.sense:35 */
    P6_5_CSD_SHIELD                 =  5,       /* csd.shield:35 */
    P6_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_5_TCPWM_LINE_COMPL6          =  8,       /* Digital Active - tcpwm.line_compl[6]:3 */
    P6_5_LCD_COM53                  = 12,       /* Digital Deep Sleep - lcd.com[53] */
    P6_5_LCD_SEG53                  = 13,       /* Digital Deep Sleep - lcd.seg[53] */
    P6_5_SCB4_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[4].i2c_sda */
    P6_5_SCB3_SPI_SELECT2           = 15,       /* Digital Deep Sleep - scb[3].spi_select2:1 */

    /* P7.0 */
    P7_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_0_CSD_SENSE                  =  4,       /* csd.sense:54 */
    P7_0_CSD_SHIELD                 =  5,       /* csd.shield:54 */
    P7_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_0_TCPWM_LINE0                =  8,       /* Digital Active - tcpwm.line[0]:2 */
    P7_0_SCB3_UART_RX               =  9,       /* Digital Active - scb[3].uart_rx:2 */
    P7_0_PASS1_DSI_SAR_DATA3        = 10,       /* Digital Active - pass[1].dsi_sar_data[3]:0 */
    P7_0_LCD_COM54                  = 12,       /* Digital Deep Sleep - lcd.com[54]:0 */
    P7_0_LCD_SEG54                  = 13,       /* Digital Deep Sleep - lcd.seg[54] */
    P7_0_SCB3_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[3].i2c_scl:2 */
    P7_0_SCB3_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[3].spi_mosi:1 */

    /* P7.1 */
    P7_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_1_CSD_SENSE                  =  4,       /* csd.sense:55 */
    P7_1_CSD_SHIELD                 =  5,       /* csd.shield:55 */
    P7_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_1_TCPWM_LINE_COMPL0          =  8,       /* Digital Active - tcpwm.line_compl[0]:2 */
    P7_1_SCB3_UART_TX               =  9,       /* Digital Active - scb[3].uart_tx:2 */
    P7_1_PASS1_DSI_SAR_DATA4        = 10,       /* Digital Active - pass[1].dsi_sar_data[4]:0 */
    P7_1_LCD_COM55                  = 12,       /* Digital Deep Sleep - lcd.com[55]:0 */
    P7_1_LCD_SEG55                  = 13,       /* Digital Deep Sleep - lcd.seg[55] */
    P7_1_SCB3_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[3].i2c_sda:2 */
    P7_1_SCB3_SPI_MISO              = 15        /* Digital Deep Sleep - scb[3].spi_miso:1 */
} en_hsiom_sel_t;

#endif /* _GPIO_PSOC4100SP256KB_64_TQFP_H_ */


/* [] END OF FILE */
